MikroElektronika/core_packages/PIC/XC8/def/PIC16F1823/mcu.h
extern volatile PORTCbits_t PORTCbits __at(0x00E);
// bitfield macros
#define _PORTC_RC0_POSN                                     0x0
#define _PORTC_RC0_POSITION                                 0x0
#define _PORTC_RC0_SIZE                                     0x1
#define _PORTC_RC0_LENGTH                                   0x1
#define _PORTC_RC0_MASK                                     0x1
#define _PORTC_RC1_POSN                                     0x1
#define _PORTC_RC1_POSITION                                 0x1
#define _PORTC_RC1_SIZE                                     0x1
#define _PORTC_RC1_LENGTH                                   0x1
#define _PORTC_RC1_MASK                                     0x2
#define _PORTC_RC2_POSN                                     0x2
#define _PORTC_RC2_POSITION                                 0x2
#define _PORTC_RC2_SIZE                                     0x1
#define _PORTC_RC2_LENGTH                                   0x1
#define _PORTC_RC2_MASK                                     0x4
#define _PORTC_RC3_POSN                                     0x3
#define _PORTC_RC3_POSITION                                 0x3
#define _PORTC_RC3_SIZE                                     0x1
#define _PORTC_RC3_LENGTH                                   0x1
#define _PORTC_RC3_MASK                                     0x8
#define _PORTC_RC4_POSN                                     0x4
#define _PORTC_RC4_POSITION                                 0x4
#define _PORTC_RC4_SIZE                                     0x1
#define _PORTC_RC4_LENGTH                                   0x1
#define _PORTC_RC4_MASK                                     0x10
#define _PORTC_RC5_POSN                                     0x5
#define _PORTC_RC5_POSITION                                 0x5
#define _PORTC_RC5_SIZE                                     0x1
#define _PORTC_RC5_LENGTH                                   0x1
#define _PORTC_RC5_MASK                                     0x20
#define _PORTC_AN4_POSN                                     0x0
#define _PORTC_AN4_POSITION                                 0x0
#define _PORTC_AN4_SIZE                                     0x1
#define _PORTC_AN4_LENGTH                                   0x1
#define _PORTC_AN4_MASK                                     0x1
#define _PORTC_AN5_POSN                                     0x1
#define _PORTC_AN5_POSITION                                 0x1
#define _PORTC_AN5_SIZE                                     0x1
#define _PORTC_AN5_LENGTH                                   0x1
#define _PORTC_AN5_MASK                                     0x2
#define _PORTC_AN6_POSN                                     0x2
#define _PORTC_AN6_POSITION                                 0x2
#define _PORTC_AN6_SIZE                                     0x1
#define _PORTC_AN6_LENGTH                                   0x1
#define _PORTC_AN6_MASK                                     0x4
#define _PORTC_AN7_POSN                                     0x3
#define _PORTC_AN7_POSITION                                 0x3
#define _PORTC_AN7_SIZE                                     0x1
#define _PORTC_AN7_LENGTH                                   0x1
#define _PORTC_AN7_MASK                                     0x8
#define _PORTC_CPS4_POSN                                    0x0
#define _PORTC_CPS4_POSITION                                0x0
#define _PORTC_CPS4_SIZE                                    0x1
#define _PORTC_CPS4_LENGTH                                  0x1
#define _PORTC_CPS4_MASK                                    0x1
#define _PORTC_CPS5_POSN                                    0x1
#define _PORTC_CPS5_POSITION                                0x1
#define _PORTC_CPS5_SIZE                                    0x1
#define _PORTC_CPS5_LENGTH                                  0x1
#define _PORTC_CPS5_MASK                                    0x2
#define _PORTC_CPS6_POSN                                    0x2
#define _PORTC_CPS6_POSITION                                0x2
#define _PORTC_CPS6_SIZE                                    0x1
#define _PORTC_CPS6_LENGTH                                  0x1
#define _PORTC_CPS6_MASK                                    0x4
#define _PORTC_CPS7_POSN                                    0x3
#define _PORTC_CPS7_POSITION                                0x3
#define _PORTC_CPS7_SIZE                                    0x1
#define _PORTC_CPS7_LENGTH                                  0x1
#define _PORTC_CPS7_MASK                                    0x8
#define _PORTC_C2INP_POSN                                   0x0
#define _PORTC_C2INP_POSITION                               0x0
#define _PORTC_C2INP_SIZE                                   0x1
#define _PORTC_C2INP_LENGTH                                 0x1
#define _PORTC_C2INP_MASK                                   0x1
#define _PORTC_C12IN1N_POSN                                 0x1
#define _PORTC_C12IN1N_POSITION                             0x1
#define _PORTC_C12IN1N_SIZE                                 0x1
#define _PORTC_C12IN1N_LENGTH                               0x1
#define _PORTC_C12IN1N_MASK                                 0x2
#define _PORTC_C12IN2N_POSN                                 0x2
#define _PORTC_C12IN2N_POSITION                             0x2
#define _PORTC_C12IN2N_SIZE                                 0x1
#define _PORTC_C12IN2N_LENGTH                               0x1
#define _PORTC_C12IN2N_MASK                                 0x4
#define _PORTC_C12IN3N_POSN                                 0x3
#define _PORTC_C12IN3N_POSITION                             0x3
#define _PORTC_C12IN3N_SIZE                                 0x1
#define _PORTC_C12IN3N_LENGTH                               0x1
#define _PORTC_C12IN3N_MASK                                 0x8
#define _PORTC_C2OUT_POSN                                   0x4
#define _PORTC_C2OUT_POSITION                               0x4
#define _PORTC_C2OUT_SIZE                                   0x1
#define _PORTC_C2OUT_LENGTH                                 0x1
#define _PORTC_C2OUT_MASK                                   0x10
#define _PORTC_SCL_POSN                                     0x0
#define _PORTC_SCL_POSITION                                 0x0
#define _PORTC_SCL_SIZE                                     0x1
#define _PORTC_SCL_LENGTH                                   0x1
#define _PORTC_SCL_MASK                                     0x1
#define _PORTC_SDA_POSN                                     0x1
#define _PORTC_SDA_POSITION                                 0x1
#define _PORTC_SDA_SIZE                                     0x1
#define _PORTC_SDA_LENGTH                                   0x1
#define _PORTC_SDA_MASK                                     0x2
#define _PORTC_P1D_POSN                                     0x2
#define _PORTC_P1D_POSITION                                 0x2
#define _PORTC_P1D_SIZE                                     0x1
#define _PORTC_P1D_LENGTH                                   0x1
#define _PORTC_P1D_MASK                                     0x4
#define _PORTC_P1C_POSN                                     0x3
#define _PORTC_P1C_POSITION                                 0x3
#define _PORTC_P1C_SIZE                                     0x1
#define _PORTC_P1C_LENGTH                                   0x1
#define _PORTC_P1C_MASK                                     0x8
#define _PORTC_P1B_POSN                                     0x4
#define _PORTC_P1B_POSITION                                 0x4
#define _PORTC_P1B_SIZE                                     0x1
#define _PORTC_P1B_LENGTH                                   0x1
#define _PORTC_P1B_MASK                                     0x10
#define _PORTC_P1A_POSN                                     0x5
#define _PORTC_P1A_POSITION                                 0x5
#define _PORTC_P1A_SIZE                                     0x1
#define _PORTC_P1A_LENGTH                                   0x1
#define _PORTC_P1A_MASK                                     0x20
#define _PORTC_SCK_POSN                                     0x0
#define _PORTC_SCK_POSITION                                 0x0
#define _PORTC_SCK_SIZE                                     0x1
#define _PORTC_SCK_LENGTH                                   0x1
#define _PORTC_SCK_MASK                                     0x1
#define _PORTC_SDI_POSN                                     0x1
#define _PORTC_SDI_POSITION                                 0x1
#define _PORTC_SDI_SIZE                                     0x1
#define _PORTC_SDI_LENGTH                                   0x1
#define _PORTC_SDI_MASK                                     0x2
#define _PORTC_SDO_POSN                                     0x2
#define _PORTC_SDO_POSITION                                 0x2
#define _PORTC_SDO_SIZE                                     0x1
#define _PORTC_SDO_LENGTH                                   0x1
#define _PORTC_SDO_MASK                                     0x4
#define _PORTC_nSS_POSN                                     0x3
#define _PORTC_nSS_POSITION                                 0x3
#define _PORTC_nSS_SIZE                                     0x1
#define _PORTC_nSS_LENGTH                                   0x1
#define _PORTC_nSS_MASK                                     0x8
#define _PORTC_SRNQ_POSN                                    0x4
#define _PORTC_SRNQ_POSITION                                0x4
#define _PORTC_SRNQ_SIZE                                    0x1
#define _PORTC_SRNQ_LENGTH                                  0x1
#define _PORTC_SRNQ_MASK                                    0x10
#define _PORTC_CCP1_POSN                                    0x5
#define _PORTC_CCP1_POSITION                                0x5
#define _PORTC_CCP1_SIZE                                    0x1
#define _PORTC_CCP1_LENGTH                                  0x1
#define _PORTC_CCP1_MASK                                    0x20
#define _PORTC_MDCIN1_POSN                                  0x2
#define _PORTC_MDCIN1_POSITION                              0x2
#define _PORTC_MDCIN1_SIZE                                  0x1
#define _PORTC_MDCIN1_LENGTH                                0x1
#define _PORTC_MDCIN1_MASK                                  0x4
#define _PORTC_MDMIN_POSN                                   0x3
#define _PORTC_MDMIN_POSITION                               0x3
#define _PORTC_MDMIN_SIZE                                   0x1
#define _PORTC_MDMIN_LENGTH                                 0x1
#define _PORTC_MDMIN_MASK                                   0x8
#define _PORTC_MDOUT_POSN                                   0x4
#define _PORTC_MDOUT_POSITION                               0x4
#define _PORTC_MDOUT_SIZE                                   0x1
#define _PORTC_MDOUT_LENGTH                                 0x1
#define _PORTC_MDOUT_MASK                                   0x10
#define _PORTC_MDCIN2_POSN                                  0x5
#define _PORTC_MDCIN2_POSITION                              0x5
#define _PORTC_MDCIN2_SIZE                                  0x1
#define _PORTC_MDCIN2_LENGTH                                0x1
#define _PORTC_MDCIN2_MASK                                  0x20
#define _PORTC_TX_POSN                                      0x4
#define _PORTC_TX_POSITION                                  0x4
#define _PORTC_TX_SIZE                                      0x1
#define _PORTC_TX_LENGTH                                    0x1
#define _PORTC_TX_MASK                                      0x10
#define _PORTC_RX_POSN                                      0x5
#define _PORTC_RX_POSITION                                  0x5
#define _PORTC_RX_SIZE                                      0x1
#define _PORTC_RX_LENGTH                                    0x1
#define _PORTC_RX_MASK                                      0x20
#define _PORTC_CK_POSN                                      0x4
#define _PORTC_CK_POSITION                                  0x4
#define _PORTC_CK_SIZE                                      0x1
#define _PORTC_CK_LENGTH                                    0x1
#define _PORTC_CK_MASK                                      0x10
#define _PORTC_DT_POSN                                      0x5
#define _PORTC_DT_POSITION                                  0x5
#define _PORTC_DT_SIZE                                      0x1
#define _PORTC_DT_LENGTH                                    0x1
#define _PORTC_DT_MASK                                      0x20

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x011);
#ifndef _LIB_BUILD
asm("PIR1 equ 011h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR1IF                 :1;
        unsigned TMR2IF                 :1;
        unsigned CCP1IF                 :1;
        unsigned SSP1IF                 :1;
        unsigned TXIF                   :1;
        unsigned RCIF                   :1;
        unsigned ADIF                   :1;
        unsigned TMR1GIF                :1;
    };
} PIR1bits_t;
